test-hotels-successful-example.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <searchHotelFaresRQ1 xmlns="http://www.softur.com.ar/wsbridge/budget.wsdl">
      <cityLocation code="MAD" xmlns="" />
      <dateFrom xmlns="">2025-11-15</dateFrom>
      <dateTo xmlns="">2025-11-18</dateTo>
      <name Code="" xmlns="" />
      <pos xmlns="">
        <id>LOZADAWS</id>
        <clave>.LOZAWS23.</clave>
      </pos>
      <currency xmlns="">USD</currency>
    </searchHotelFaresRQ1>
  </soap:Body>
</soap:Envelope>